FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/НакоплениеСумм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НакоплениеСумм</Name>
			<Comment>Накопление сумм для накопительных скидок</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма накопления</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧеков</Name>
					<Comment>Количество чеков в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНоменклатуры</Name>
					<Comment>Количество номенклатуры в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Comment>Дисконтная, накопительная или карточка клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНакопления</Name>
					<Comment>Дата суммы накопления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>Документ отгрузки контрагенту</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковНакопительныхСумм</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателяАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Чек</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеНакопительныхСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/НакоплениеСумм/Ext/RecordSetModule.bsl
Перем ДокументОбъект Экспорт; // документ, выполняющий накопление
Перем Карточка Экспорт;       // накопительная карта
Перем Сторно Экспорт;         // Булево. Ложь - накапливаем суммы, Истина - снимаем накопление.
Перем Контрагент Экспорт;     // СправочникСсылка.Контрагенты
Перем КоличествоНоменклатуры Экспорт; // Число.

Перем ТаблицаЗаписей;

// Добавление суммы накопления
Функция НакоплениеСуммы() Экспорт
	// проверим надо ли вообще что нибудь накапливать
	Если Константы.ПериодНакопительныхСкидок.Получить()=Перечисления.ПериодичностьАнализаНакопительныхСкидок.НеИспользуется Тогда
		ДокументОбъект=Неопределено;
		Возврат Истина; // не надо
	КонецЕсли;
	
	// отберем набор записей по документу
	Отбор.Документ.Значение=ДокументОбъект.Ссылка; Отбор.Документ.Использование=Истина;
	ТаблицаЗаписей=ЭтотОбъект.Выгрузить();
	ТаблицаЗаписей.Очистить();
	
	// регистрируем накопление суммы
	НоваяЗапись=ТаблицаЗаписей.Добавить();
	НоваяЗапись.Контрагент=Контрагент;
	НоваяЗапись.Карточка=Карточка;
	НоваяЗапись.ПериодНакопления=ДокументОбъект.Дата;
	НоваяЗапись.Подразделение=ДокументОбъект.ПодразделениеКомпании;
	НоваяЗапись.Документ=ДокументОбъект.Ссылка;
	Знак=?(Сторно=Неопределено ИЛИ НЕ Сторно,1,-1);
	ВалютаНакопительныхСумм=Константы.ВалютаНакопительныхСумм.Получить();
	Если ВалютаНакопительныхСумм=ДокументОбъект.ВалютаДокумента Тогда
		НоваяЗапись.Сумма=Знак*ДокументОбъект.СуммаДокумента;
	Иначе
		НоваяЗапись.Сумма=Знак*обПересчет(ДокументОбъект.СуммаДокумента,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаНакопительныхСумм,ДокументОбъект.Дата);
	КонецЕсли; 
	НоваяЗапись.КоличествоЧеков=Знак*1;
	НоваяЗапись.КоличествоНоменклатуры=Знак*КоличествоНоменклатуры;
	
	//Данный участок кода потенциально может замедлить проведение документов
	//При необходимости отключить право "Автоматическое сторнирование свернутых сумм накопления"
	//Сторнирование свернутых накопительных сумм по документу
	Попытка
		ДокументОбъектПрава=ДокументОбъект.Права;
	Исключение
		ДокументОбъектПрава=Неопределено;
	КонецПопытки; 
	АвтоматическоеСторнированиеСвернутыхСуммНакопления=обПраво("АвтоматическоеСторнированиеСвернутыхСуммНакопления",ДокументОбъектПрава);
	Если АвтоматическоеСторнированиеСвернутыхСуммНакопления Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ЗакрытиеНакопительныхСуммНакопления.Контрагент,
		|	ЗакрытиеНакопительныхСуммНакопления.Карточка,
		|	ЗакрытиеНакопительныхСуммНакопления.ПериодНакопления,
		|	ЗакрытиеНакопительныхСуммНакопления.Подразделение,
		|	ЗакрытиеНакопительныхСуммНакопления.Документ,
		|	ЗакрытиеНакопительныхСуммНакопления.ДокументТип,
		|	ЗакрытиеНакопительныхСуммНакопления.ДокументПредставление,
		|	ЗакрытиеНакопительныхСуммНакопления.Сумма,
		|	ЗакрытиеНакопительныхСуммНакопления.КоличествоЧеков,
		|	ЗакрытиеНакопительныхСуммНакопления.КоличествоНоменклатуры
		|ИЗ
		|	Документ.ЗакрытиеНакопительныхСумм.Накопления КАК ЗакрытиеНакопительныхСуммНакопления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗакрытиеНакопительныхСуммНакопления.Ссылка";
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
				СсылкаНаДокумент=Документы[Выборка.ДокументТип].ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.Документ));
				Если СсылкаНаДокумент<>Неопределено И СсылкаНаДокумент=ДокументОбъект.Ссылка Тогда
					НоваяЗапись=ТаблицаЗаписей.Добавить();
					НоваяЗапись.Контрагент=Выборка.Контрагент;
					НоваяЗапись.Карточка=Выборка.Карточка;
					НоваяЗапись.ПериодНакопления=Выборка.ПериодНакопления;
					НоваяЗапись.Подразделение=Выборка.Подразделение;
					НоваяЗапись.Документ=СсылкаНаДокумент;
					Знак=?(Сторно=Неопределено ИЛИ НЕ Сторно,-1,1);
					НоваяЗапись.Сумма=Знак*Выборка.Сумма;
					НоваяЗапись.КоличествоЧеков=Знак*Выборка.КоличествоЧеков;
					НоваяЗапись.КоличествоНоменклатуры=Знак*Выборка.КоличествоНоменклатуры;
				КонецЕсли; 
			Исключение
				Продолжить;
			КонецПопытки; 
		КонецЦикла;
	КонецЕсли; 
	
	СтрокаИзмерений="";
	Для каждого ИзмерениеРегистра Из ЭтотОбъект.Метаданные().Измерения Цикл
		СтрокаИзмерений=СтрокаИзмерений+?(ПустаяСтрока(СтрокаИзмерений),"",",")+СокрЛП(ИзмерениеРегистра.Имя);
	КонецЦикла; 
	СтрокаРесурсов="";
	Для каждого РесурсРегистра Из ЭтотОбъект.Метаданные().Ресурсы Цикл
		СтрокаРесурсов=СтрокаРесурсов+?(ПустаяСтрока(СтрокаРесурсов),"",",")+СокрЛП(РесурсРегистра.Имя);
	КонецЦикла;
	ТаблицаЗаписей.Свернуть(СтрокаИзмерений,СтрокаРесурсов);
	ЭтотОбъект.Загрузить(ТаблицаЗаписей);
	
	Попытка
		Записать();
	Исключение
		дкСообщитьРезультат("Ошибка записи накопительной суммы","Важное&Накопительные суммы:",ЭтотОбъект);
		ДокументОбъект=Неопределено;
		Возврат Ложь;
	КонецПопытки; 
	
	ДокументОбъект=Неопределено;
	Возврат Истина;
КонецФункции // НакоплениеСуммы()

// отмена проведения документа
Функция ОтменаПроведения() Экспорт
	Отбор.Документ.Значение=ДокументОбъект.Ссылка; Отбор.Документ.Использование=Истина;
	ТаблицаЗаписей=ЭтотОбъект.Выгрузить();
	ТаблицаЗаписей.Очистить();
	
	//Данный участок кода потенциально может замедлить проведение документов
	//При необходимости отключить право "Автоматическое сторнирование свернутых сумм накопления"
	//Сторнирование свернутых накопительных сумм по документу
	Попытка
		ДокументОбъектПрава=ДокументОбъект.Права;
	Исключение
		ДокументОбъектПрава=Неопределено;
	КонецПопытки; 
	АвтоматическоеСторнированиеСвернутыхСуммНакопления=обПраво("АвтоматическоеСторнированиеСвернутыхСуммНакопления",ДокументОбъектПрава);
	Если АвтоматическоеСторнированиеСвернутыхСуммНакопления Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ЗакрытиеНакопительныхСуммНакопления.Контрагент,
		|	ЗакрытиеНакопительныхСуммНакопления.Карточка,
		|	ЗакрытиеНакопительныхСуммНакопления.ПериодНакопления,
		|	ЗакрытиеНакопительныхСуммНакопления.Подразделение,
		|	ЗакрытиеНакопительныхСуммНакопления.Документ,
		|	ЗакрытиеНакопительныхСуммНакопления.ДокументТип,
		|	ЗакрытиеНакопительныхСуммНакопления.ДокументПредставление,
		|	ЗакрытиеНакопительныхСуммНакопления.Сумма,
		|	ЗакрытиеНакопительныхСуммНакопления.КоличествоЧеков,
		|	ЗакрытиеНакопительныхСуммНакопления.КоличествоНоменклатуры
		|ИЗ
		|	Документ.ЗакрытиеНакопительныхСумм.Накопления КАК ЗакрытиеНакопительныхСуммНакопления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗакрытиеНакопительныхСуммНакопления.Ссылка";
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
				СсылкаНаДокумент=Документы[Выборка.ДокументТип].ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.Документ));
				Если СсылкаНаДокумент<>Неопределено И СсылкаНаДокумент=ДокументОбъект.Ссылка Тогда
					НоваяЗапись=ТаблицаЗаписей.Добавить();
					НоваяЗапись.Контрагент=Выборка.Контрагент;
					НоваяЗапись.Карточка=Выборка.Карточка;
					НоваяЗапись.ПериодНакопления=Выборка.ПериодНакопления;
					НоваяЗапись.Подразделение=Выборка.Подразделение;
					НоваяЗапись.Документ=СсылкаНаДокумент;
					Знак=?(Сторно=Неопределено ИЛИ НЕ Сторно,-1,1);
					НоваяЗапись.Сумма=Знак*Выборка.Сумма;
					НоваяЗапись.КоличествоЧеков=Знак*Выборка.КоличествоЧеков;
					НоваяЗапись.КоличествоНоменклатуры=Знак*Выборка.КоличествоНоменклатуры;
				КонецЕсли; 
			Исключение
				Продолжить;
			КонецПопытки; 
		КонецЦикла;
	КонецЕсли; 
	
	СтрокаИзмерений="";
	Для каждого ИзмерениеРегистра Из ЭтотОбъект.Метаданные().Измерения Цикл
		СтрокаИзмерений=СтрокаИзмерений+?(ПустаяСтрока(СтрокаИзмерений),"",",")+СокрЛП(ИзмерениеРегистра.Имя);
	КонецЦикла; 
	СтрокаРесурсов="";
	Для каждого РесурсРегистра Из ЭтотОбъект.Метаданные().Ресурсы Цикл
		СтрокаРесурсов=СтрокаРесурсов+?(ПустаяСтрока(СтрокаРесурсов),"",",")+СокрЛП(РесурсРегистра.Имя);
	КонецЦикла;
	ТаблицаЗаписей.Свернуть(СтрокаИзмерений,СтрокаРесурсов);
	ЭтотОбъект.Загрузить(ТаблицаЗаписей);
	
	Попытка
		Записать();
	Исключение
		дкСообщитьРезультат("Ошибка записи накопительной суммы","Важное&Накопительные суммы:",ЭтотОбъект);
		ДокументОбъект=Неопределено;
		Возврат Ложь;
	КонецПопытки; 
	
	ДокументОбъект=Неопределено;
	Возврат Истина;
КонецФункции

Сторно=Неопределено;
